'''
Created on 2023. 10. 17.

@author: gram
'''

# _*_ coding:utf-8 -*_
# 파이썬2 사용하는 경우: 기본 인코딩이 ascii라서 한글 디코딩 불가
# 파이썬3 사용하는 경우: 기본 인코딩이 UTF-8, 굳이 안써도 됨
#                    다른 개발환경에 연결하거나, 다른 툴 사용할때 명시O

# Python....
#      [Big Data, AI]
#      #분석용 데이터 구축
#                          -직접
#                         -누군가가 모아놓은 데이터를 구매
#                         -(위의 두 방법을 못하는 경우) 웹 데이터 가져오기(XML, JSON, HTML)
#      분석 - (사람) -> BigData분석 프로젝트 
#      분석-  (AI) -> AI 프로젝트  
#      결과를 한눈에 알아보기 쉽게... => 시각화 (표, 그래프, ....) 

#      => Python은 빅데이터 분석용 도구? 툴 ? => X => 프로그래밍 언어!!!

##################################################################
#                Java vs Phthon
##################################################################
#Java: 규칙의 언어
#          필수)
#                 JDK설치
#          옵션)
#                 eclipse 설치
#                 Project는 중요한 개념!!
#                 컴파일러 방식
#                 OOP의 코드를 재사용하기 위해 1 file = 1 class


# Python: 자유의 언어 
#           필수)
#                python 설치(ver 3.8.10) - 개발 툴 IDLE이 딸려옴
#                Add Python 3.8 Path 체크 - cmd 환경에서 명령어를 쓰기 편하게...
#          옵션)
#                 eclipse에서 pydev 추가
#                 Project는 그저 단순한 폴더일뿐...
#                 인터프리터 방식
#                 OOP의 코드를 재사용 > 관심 X : 1 file != 1 class
##################################################################
#  Big Data:
#            1) Python : 분석용 데이터 구축
#            2) Hadoop: 분석 << 리눅스
#            3) phthon : 시각화 

#            데이터 구축
#            1) python으로 xml/json 파싱 => DB에 넣는
#            2) DB에 있는 데이터를 분석용 파일로...(.csv, txt 파일)
#################################################################
