package oop20230706;

public class VariableEx4 {

	public static void main(String[] args) {
		
	System.out.println(0b10);
	System.out.println(10);
	System.out.println(010);
	System.out.println(0x10);
	//10진정수로 변환하여 [문자열] 출력
		
		
	}
}


/*===[2진법] Nbit자리수의 경우의 수의 표현 범위
 *  1bit의 경우 : []    1자리 [0] 또는 [1]   -> 2가지 표현 가능하다.
 *  2bit의 경우 : [][]  2자리 00,01,10,11   -> 4가지 표현 가능하다.
 *  3bit의 경우 : [][][]3자리 000,001,010,011,100,101,110,111 ->8가지 표현 가능하다.
 *  Nbit의 경우 : ------N자리 --------------------------------->2n승가지 표현 가능하다. 
 * 
 * ===2진수 자리수의 가중치
 * 위치 10    9     8    7    6    5   4  3 2 1 0 . -1   -2
 *     1024  512   256  128  64  32  16  8 4 2 1   0.5  0.25
 *   
 * 
 */




